In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])

In [3]:
data

a  1   -0.381180
   2    1.011507
   3   -0.325748
b  1   -0.076299
   3   -0.714525
c  1   -0.406702
   2    0.317634
d  2    1.377705
   3    0.946435
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

### Indexing

In [5]:
data["a"]

1   -0.381180
2    1.011507
3   -0.325748
dtype: float64

In [6]:
data[:,2]

a    1.011507
c    0.317634
d    1.377705
dtype: float64

In [7]:
data.loc[['b','d']]

b  1   -0.076299
   3   -0.714525
d  2    1.377705
   3    0.946435
dtype: float64

In [8]:
data[['a','c']]

a  1   -0.381180
   2    1.011507
   3   -0.325748
c  1   -0.406702
   2    0.317634
dtype: float64

In [9]:
data.unstack()

          1         2         3
a -0.381180  1.011507 -0.325748
b -0.076299       NaN -0.714525
c -0.406702  0.317634       NaN
d       NaN  1.377705  0.946435

In [10]:
data

a  1   -0.381180
   2    1.011507
   3   -0.325748
b  1   -0.076299
   3   -0.714525
c  1   -0.406702
   2    0.317634
d  2    1.377705
   3    0.946435
dtype: float64

In [30]:
 frame = pd.DataFrame(np.arange(12).reshape((4, 3)),index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [31]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [32]:
frame.index.names=['key1','key2']

In [33]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [34]:
frame.columns.names=['state','color']

In [35]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [36]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [37]:
frame.loc['a']

state  Ohio     Colorado
color Green Red    Green
key2
1         0   1        2
2         3   4        5

In [20]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           names=['key1', 'key2'])

In [21]:
frame.swaplevel('key1',"key2").loc[1]

state  Ohio     Colorado
color Green Red    Green
key1
a         0   1        2
b         6   7        8

In [22]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [23]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Summary statistics by level

In [31]:
frame.sum(level=0)

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [32]:
frame.sum(level=1,axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [47]:
frame.sum(level=0,axis=1)

state      Ohio  Colorado
key1 key2
a    1        1         2
     2        7         5
b    1       13         8
     2       19        11

In [24]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1), 'c': ['one', 'one', 'one', 'two', 'two','two', 'two'],'d': [0, 1, 2, 0, 1, 2, 3]})

In [25]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [26]:
frame.set_index(['c','d'])

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [27]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [28]:
frame.set_index(['c','d']).reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

###  Cross sectional function

In [38]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [46]:
frame.xs(1,level='key2')

state  Ohio     Colorado
color Green Red    Green
key1
a         0   1        2
b         6   7        8

In [ ]:
frame.xs('Green',level=1,axis=)